Revit 2026 API

# DirectShapeTypeAppendShape(IListGeometryObject, DirectShapeTargetViewType) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AppendShape(
	IList<GeometryObject> pGeomArr,
	DirectShapeTargetViewType viewType
)
```
```vb
Public Sub AppendShape (
	pGeomArr As IList(Of GeometryObject),
	viewType As DirectShapeTargetViewType
)
```
```cpp
public:
void AppendShape(
	IList<GeometryObject^>^ pGeomArr,
	DirectShapeTargetViewType viewType
)
```
```fsharp
member AppendShape :
        pGeomArr : IList<GeometryObject> *
        viewType : DirectShapeTargetViewType -> unit
```

#### Parameters

pGeomArr IListGeometryObject

viewType DirectShapeTargetViewType

#### Reference

DirectShapeType Class

AppendShape Overload

Autodesk.Revit.DB Namespace